Twilight-Logic/AR488/src-refactored/AR488/src/Boards/Pico/RP2040_EP.cpp
void setGpibCtrlState(uint8_t bits, uint8_t mask){

  uint8_t masked = bits & mask;

  uint32_t gpiobits = ( ((masked & 0x3F) << gpioCtrlOffset) | ((masked & 0xC0) << (gpioCtrlOffset + 4) ) );
  uint32_t gpiomask = ( ((mask & 0x3F) << gpioCtrlOffset) | ((mask & 0xC0) << (gpioCtrlOffset + 4)) );

  gpio_put_masked(gpiomask, gpiobits);

}


/*
   Bits control lines as follows: 7-ATN_PIN, 6-SRQ_PIN, 5-REN_PIN, 4-EOI_PIN, 3-DAV_PIN, 2-NRFD_PIN, 1-NDAC_PIN, 0-IFC_PIN
    bits : 0=input pullup, 1=output
    mask : 0=unaffected, 1=affected
*/
void setGpibCtrlDir(uint8_t bits, uint8_t mask){

  uint8_t masked = bits & mask;
  uint8_t rmasked = ~bits & mask;

  uint32_t gpioOmask = ( ((masked & 0x3F) << gpioCtrlOffset) | ((masked & 0xC0) << (gpioCtrlOffset + 4) ) );
  uint32_t gpioImask = ( ((rmasked & 0x3F) << gpioCtrlOffset) | ((rmasked & 0xC0) << (gpioCtrlOffset + 4) ) );

  if (gpioOmask){
    gpio_clear_pullups_masked(gpioOmask);
    gpio_set_dir_out_masked(gpioOmask);
  }

  if (gpioImask){
    gpio_set_pullups_masked(gpioImask);
    gpio_set_dir_in_masked(gpioImask);
  }
  
}


uint8_t getGpibPinState(uint8_t pin){
  return digitalRead(pin);
}


#endif // RAS_PICO_L3
/***** ^^^^^^^^^^^^^^^^^^^^^^^ *****/
/***** RAS PICO BOARD LAYOUT 3 *****/
/***********************************/



/***********************************/
/***** RAS PICO BOARD LAYOUT 4 *****/
/***** vvvvvvvvvvvvvvvvvvvvvvv *****/
#ifdef RAS_PICO_L4
/*
  Data pin map
  ------------
  DIO1_PIN  10 : GPIB 10 : GPIO14
  DIO2_PIN  11 : GPIB 11 : GPIO15
  DIO3_PIN  12 : GPIB 12 : GPIO16
  DIO4_PIN  13 : GPIB 13 : GPIO17
  DIO5_PIN  14 : GPIB 14 : GPIO18
  DIO6_PIN  15 : GPIB 15 : GPIO19
  DIO7_PIN  20 : GPIB 20 : GPIO20
  DIO8_PIN  21 : GPIB 21 : GPIO21

  Control pin map
  ---------------
  IFC_PIN    2 : GPIB 9  : GPIO6  : b0
  NDAC_PIN   3 : GPIB 8  : GPIO7  : b1
  NRFD_PIN   4 : GPIB 7  : GPIO8  : b2
  DAV_PIN    5 : GPIB 6  : GPIO9  : b3
  EOI_PIN    6 : GPIB 5  : GPIO10 : b4
  REN_PIN    7 : GPIB 17 : GPIO11 : b5
  SRQ_PIN    8 : GPIB 10 : GPIO12 : b6
  ATN_PIN    9 : GPIB 11 : GPIO13 : b7

  Bits control lines as follows: 7-ATN_PIN, 6-SRQ_PIN, 5-REN_PIN, 4-EOI_PIN, 3-DAV_PIN, 2-NRFD_PIN, 1-NDAC_PIN, 0-IFC_PIN
    bits (databits) : State - 0=LOW, 1=HIGH/INPUT_PULLUP; Direction - 0=input, 1=output;
    mask (mask)     : 0=unaffected, 1=enabled
*/


const uint32_t gpioDbMask = 0x0030FC00;
const uint32_t gpioCtrlMask = 0x000003FC;
const uint8_t gpioDbOffset = 10;
const uint8_t gpioCtrlOffset = 2;


#ifdef USE_RP2040_FUNC_LIST
void gpioFuncList(){
  Serial.println();
  Serial.print(F("Pull: "));
  for (uint8_t i=21; i>5; i--){
    Serial.print(gpio_is_pulled_up(i));
  }
  Serial.println();
  Serial.print(F("Outs: "));
  for (uint8_t i=21; i>5; i--){
    Serial.print(gpio_is_dir_out(i));
  }
  Serial.println();
}
#endif


/***** Set GPIO internal pullup resistors *****/
void gpio_set_pullups_masked(uint32_t mask){
  for (uint8_t i=0; i<32; i++){
    if ( mask & (1<<i) ) gpio_pull_up(i);
  }
}


/***** Disable GPIO pull-up resistors *****/
void gpio_clear_pullups_masked(uint32_t mask){
  for (uint8_t i=0; i<32; i++){
    if ( mask & (1<<i) ) gpio_disable_pulls(i);
  }
}


/***** Initialise all GPIO pins *****/
void initRpGpioPins(){
  uint32_t gpiomask = gpioCtrlMask | gpioDbMask;  // Scope of GPIO pins to be allocated to GPIB
  gpio_init_mask(gpiomask);                       // Configure as GPIO pins those allocated to GPIB
  gpio_set_dir_in_masked(gpiomask);               // Configure all as inputs by default
  gpio_set_pullups_masked(gpiomask);              // Enable all pullups (un-asserted) by default
  delayMicroseconds(50);                          // Allow some settling time
}


/***** Set the GPIB data bus to input pullup *****/
void readyGpibDbus(uint8_t state = INPUT_PULLUP) {
  if (state == OUTPUT) {
    gpio_set_dir_out_masked(gpioDbMask);
    // Set outputs to high
    gpio_put_masked(gpioDbMask, gpioDbMask);
    return;
  }

  // Set data pins to input
  gpio_set_dir_in_masked(gpioDbMask);
  gpio_set_pullups_masked(gpioDbMask);
  
}


/***** Read the GPIB data bus wires to collect the byte of data *****/
uint8_t readGpibDbus() {
  // Read the byte of data on the bus
  uint32_t gpioall = gpio_get_all();
  gpioall = ((gpioall & 0x0000FC00) >> gpioDbOffset) | ((gpioall & 0x00300000) >> (gpioDbOffset + 4));
  return (uint8_t)~gpioall;  
}


/***** Set the GPIB data bus to output and with the requested byte *****/
void setGpibDbus(uint8_t db) {
  uint8_t rdb = ~db;
  uint32_t gpioall = ( ((rdb & 0x3F) << gpioDbOffset) | ((rdb & 0xC0) << (gpioDbOffset + 4)) );
  gpio_clear_pullups_masked(gpioDbMask);
  gpio_set_dir_out_masked(gpioDbMask);
  gpio_put_masked(gpioDbMask, gpioall);
}


void setGpibCtrlState(uint8_t bits, uint8_t mask){

  uint8_t maskedbits = bits & mask;
  uint32_t gpiobits = (maskedbits << gpioCtrlOffset);
  uint32_t gpiomask = (mask << gpioCtrlOffset);

  gpio_put_masked(gpiomask, gpiobits);

}


/*
   Bits control lines as follows: 7-ATN_PIN, 6-SRQ_PIN, 5-REN_PIN, 4-EOI_PIN, 3-DAV_PIN, 2-NRFD_PIN, 1-NDAC_PIN, 0-IFC_PIN
    bits : 0=input pullup, 1=output
    mask : 0=unaffected, 1=affected
*/
void setGpibCtrlDir(uint8_t bits, uint8_t mask){

  uint8_t masked = bits & mask;
  uint8_t rmasked = ~bits & mask;

  uint32_t gpioOmask = ( masked << gpioCtrlOffset );
  uint32_t gpioImask = ( rmasked << gpioCtrlOffset );

  if (gpioOmask){
    gpio_clear_pullups_masked(gpioOmask);
    gpio_set_dir_out_masked(gpioOmask);
  }

  if (gpioImask){
    gpio_set_pullups_masked(gpioImask);
    gpio_set_dir_in_masked(gpioImask);
  }
  
}


uint8_t getGpibPinState(uint8_t pin){
  return digitalRead(pin);
}

#endif // RAS_PICO_L4
/***** ^^^^^^^^^^^^^^^^^^^^^^^ *****/
/***** RAS PICO BOARD LAYOUT 4 *****/
/***********************************/



/***********************************/
/***** RAS PICO BOARD LAYOUT 5 *****/
/***** vvvvvvvvvvvvvvvvvvvvvvv *****/
#ifdef RAS_PICO_LAUTO
/*

  TE = 22
  TC = REN

  Data pin map
  ------------
  DIO1_PIN  10 : GPIB 10 : GPIO14
  DIO2_PIN  11 : GPIB 11 : GPIO15
  DIO3_PIN  12 : GPIB 12 : GPIO16
  DIO4_PIN  13 : GPIB 13 : GPIO17
  DIO5_PIN  14 : GPIB 14 : GPIO18
  DIO6_PIN  15 : GPIB 15 : GPIO19
  DIO7_PIN  20 : GPIB 20 : GPIO20
  DIO8_PIN  21 : GPIB 21 : GPIO21

  Control pin map
  ---------------
  IFC_PIN    9 : GPIB 9  : GPIO6  : b0
  NDAC_PIN   8 : GPIB 8  : GPIO7  : b1
  NRFD_PIN   7 : GPIB 7  : GPIO8  : b2
  DAV_PIN    6 : GPIB 6  : GPIO9  : b3
  EOI_PIN    5 : GPIB 5  : GPIO10 : b4
  REN_PIN    3 : GPIB 17 : GPIO11 : b5
  SRQ_PIN    4 : GPIB 10 : GPIO12 : b6
  ATN_PIN    2 : GPIB 11 : GPIO13 : b7

